/*
Рассмотрим 2 таблицы:

LongTable:

+---------+--------+-----------------------+
|  Name   |   key  |        value          |
+---------+--------+-----------------------+
| Ivanov  |   FIO  |  Иванов Иван Иванович |
+---------+--------+-----------------------+
| Ivanov  | Phone  |  +(7) 111-1111111     |
+---------+--------+-----------------------+
| Ivanov  | Email  | ivanov@ivanov.com     |
+---------+--------+-----------------------+
| Petrov  |   FIO  | Петров Петр Петрович  |
+---------+--------+-----------------------+
| Petrov  | Phone  |  +(7) 222-2222222     |
+---------+--------+-----------------------+
| Petrov  | Email  | petrov@petrov.com     |
+---------+--------+-----------------------+

WideTable:

+---------+----------------------+------------------+-------------------+
|   Name  |         FIO          |      Phone       |       Email       |
+---------+----------------------+------------------+-------------------+
| Ivanov  | Иванов Иван Иванович | +(7) 111-1111111 | ivanov@ivanov.com |
+---------+----------------------+------------------+-------------------+
| Petrov  | Петров Петр Петрович | +(7) 222-2222222 | petrov@petrov.com |
+---------+----------------------+------------------+-------------------+

Как из таблицы WideTable получить LongTable?

Отсортируйте ответ по столбцам:

    Name
    key
    value
    */
    
    with t1 as (
  select name,'FIO' as key,FIO as value from WideTable
  ),
  t2 as (
  select name,'Phone',Phone from WideTable
  ),
  t3 as (
  select name,'Email',Email from WideTable
  )
select * from t1
  union
select * from t2
  union
select * from t3
  order by name, key, value
;
